Jmeter/jmeter_logs/jmeter_regular_log_20241127_162859.log
2024-11-27 16:29:02,360 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2024-11-27 16:29:02,399 INFO o.a.j.JMeter: Loading user properties from: C:\Utils\apache-jmeter-5.6.3\bin\user.properties
2024-11-27 16:29:02,400 INFO o.a.j.JMeter: Loading system properties from: C:\Utils\apache-jmeter-5.6.3\bin\system.properties
2024-11-27 16:29:02,413 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2024-11-27 16:29:02,414 INFO o.a.j.JMeter: Version 5.6.3
2024-11-27 16:29:02,414 INFO o.a.j.JMeter: java.version=19.0.1
2024-11-27 16:29:02,414 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2024-11-27 16:29:02,425 INFO o.a.j.JMeter: os.name=Windows 10
2024-11-27 16:29:02,425 INFO o.a.j.JMeter: os.arch=amd64
2024-11-27 16:29:02,426 INFO o.a.j.JMeter: os.version=10.0
2024-11-27 16:29:02,426 INFO o.a.j.JMeter: file.encoding=UTF-8
2024-11-27 16:29:02,426 INFO o.a.j.JMeter: java.awt.headless=true
2024-11-27 16:29:02,426 INFO o.a.j.JMeter: Max memory     =1073741824
2024-11-27 16:29:02,427 INFO o.a.j.JMeter: Available Processors =16
2024-11-27 16:29:02,445 INFO o.a.j.JMeter: Default Locale=English (EN)
2024-11-27 16:29:02,445 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2024-11-27 16:29:02,445 INFO o.a.j.JMeter: JMeterHome=C:\Utils\apache-jmeter-5.6.3
2024-11-27 16:29:02,445 INFO o.a.j.JMeter: user.dir  =C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter
2024-11-27 16:29:02,447 INFO o.a.j.JMeter: PWD       =C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter
2024-11-27 16:29:06,977 INFO o.a.j.JMeter: IP: 169.254.5.254 Name: OlijebwaPC FullName: OlijebwaPC
2024-11-27 16:29:07,004 INFO o.a.j.s.FileServer: Default base='C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter'
2024-11-27 16:29:07,008 INFO o.a.j.s.FileServer: Set new base='C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter'
2024-11-27 16:29:07,403 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2024-11-27 16:29:07,446 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2024-11-27 16:29:07,452 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2024-11-27 16:29:07,452 INFO o.a.j.s.SaveService: Loading file: C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter\traffic_simulation.jmx
2024-11-27 16:29:07,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 16:29:07,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 16:29:07,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 16:29:07,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 16:29:07,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2024-11-27 16:29:07,548 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2024-11-27 16:29:07,588 INFO o.a.j.JMeter: Creating summariser <summary>
2024-11-27 16:29:07,628 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2024-11-27 16:29:07,628 INFO o.a.j.s.SampleEvent: List of sample_variables: [FLIGHTTOCOUNT, FLIGHTRETCOUNT, ONEWAY]
2024-11-27 16:29:07,628 INFO o.a.j.s.SampleEvent: List of sample_variables: [FLIGHTTOCOUNT, FLIGHTRETCOUNT, ONEWAY]
2024-11-27 16:29:07,636 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2024-11-27 16:29:07,636 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2024-11-27 16:29:07,748 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-2.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 16:29:07,764 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\json-simple-1.1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 16:29:07,772 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\acmeair-jmeter-2.0.0-SNAPSHOT.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 16:29:07,788 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.6.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 16:29:07,968 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 16:29:07,998 INFO o.a.j.JMeter: Running test (1732742947998)
2024-11-27 16:29:08,054 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : jp@gc - Stepping Thread Group
2024-11-27 16:29:08,062 INFO o.a.j.e.StandardJMeterEngine: Starting 100 threads for group jp@gc - Stepping Thread Group.
2024-11-27 16:29:08,062 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2024-11-27 16:29:08,062 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 100
2024-11-27 16:29:08,163 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2024-11-27 16:29:08,163 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2024-11-27 16:29:38,063 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-1
2024-11-27 16:29:38,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-2
2024-11-27 16:29:38,420 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = OlijebwaPC
2024-11-27 16:29:38,434 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2024-11-27 16:29:38,437 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2024-11-27 16:29:38,437 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2024-11-27 16:29:38,437 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2024-11-27 16:29:38,438 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2024-11-27 16:29:38,462 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-3
2024-11-27 16:29:38,629 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2024-11-27 16:29:38,639 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2024-11-27 16:29:38,640 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2024-11-27 16:29:38,665 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-4
2024-11-27 16:29:38,863 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-5
2024-11-27 16:29:44,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-6
2024-11-27 16:29:44,262 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-7
2024-11-27 16:29:44,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-8
2024-11-27 16:29:44,664 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-9
2024-11-27 16:29:44,864 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-10
2024-11-27 16:29:50,063 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-11
2024-11-27 16:29:50,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-12
2024-11-27 16:29:50,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-13
2024-11-27 16:29:50,663 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-14
2024-11-27 16:29:50,863 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-15
2024-11-27 16:29:56,063 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-16
2024-11-27 16:29:56,264 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-17
2024-11-27 16:29:56,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-18
2024-11-27 16:29:56,662 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-19
2024-11-27 16:29:56,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-20
2024-11-27 16:30:02,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-21
2024-11-27 16:30:02,262 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-22
2024-11-27 16:30:02,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-23
2024-11-27 16:30:02,662 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-24
2024-11-27 16:30:02,863 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-25
2024-11-27 16:30:08,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-26
2024-11-27 16:30:08,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-27
2024-11-27 16:30:08,462 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-28
2024-11-27 16:30:08,662 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-29
2024-11-27 16:30:08,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-30
2024-11-27 16:30:14,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-31
2024-11-27 16:30:14,262 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-32
2024-11-27 16:30:14,462 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-33
2024-11-27 16:30:14,662 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-34
2024-11-27 16:30:14,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-35
2024-11-27 16:30:20,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-36
2024-11-27 16:30:20,267 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-37
2024-11-27 16:30:20,462 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-38
2024-11-27 16:30:20,663 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-39
2024-11-27 16:30:20,863 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-40
2024-11-27 16:30:26,064 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-41
2024-11-27 16:30:26,264 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-42
2024-11-27 16:30:26,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-43
2024-11-27 16:30:26,663 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-44
2024-11-27 16:30:26,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-45
2024-11-27 16:30:32,064 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-46
2024-11-27 16:30:32,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-47
2024-11-27 16:30:32,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-48
2024-11-27 16:30:32,662 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-49
2024-11-27 16:30:32,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-50
2024-11-27 16:30:38,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-51
2024-11-27 16:30:38,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-52
2024-11-27 16:30:38,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-53
2024-11-27 16:30:38,664 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-54
2024-11-27 16:30:38,863 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-55
2024-11-27 16:30:44,063 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-56
2024-11-27 16:30:44,262 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-57
2024-11-27 16:30:44,462 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-58
2024-11-27 16:30:44,663 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-59
2024-11-27 16:30:44,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-60
2024-11-27 16:30:50,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-61
2024-11-27 16:30:50,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-62
2024-11-27 16:30:50,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-63
2024-11-27 16:30:50,665 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-64
2024-11-27 16:30:50,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-65
2024-11-27 16:30:56,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-66
2024-11-27 16:30:56,264 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-67
2024-11-27 16:30:56,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-68
2024-11-27 16:30:56,663 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-69
2024-11-27 16:30:56,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-70
2024-11-27 16:31:02,062 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-71
2024-11-27 16:31:02,263 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-72
2024-11-27 16:31:02,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-73
2024-11-27 16:31:02,663 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-74
2024-11-27 16:31:02,862 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-75
2024-11-27 16:31:02,941 INFO o.a.j.r.Summariser: summary +      1 in 00:01:55 =    0.0/s Avg: 84339 Min: 84339 Max: 84339 Err:     1 (100.00%) Active: 75 Started: 75 Finished: 0
2024-11-27 16:31:08,063 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-76
2024-11-27 16:31:08,262 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-77
2024-11-27 16:31:08,463 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-78
2024-11-27 16:31:08,662 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-79
2024-11-27 16:31:08,863 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-80
2024-11-27 16:31:11,563 INFO o.a.j.r.ResultCollector: Shutdown hook started