Jmeter/jmeter_logs/jmeter_regular_log_20241127_201046.log
2024-11-27 20:10:47,779 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2024-11-27 20:10:47,803 INFO o.a.j.JMeter: Loading user properties from: C:\Utils\apache-jmeter-5.6.3\bin\user.properties
2024-11-27 20:10:47,805 INFO o.a.j.JMeter: Loading system properties from: C:\Utils\apache-jmeter-5.6.3\bin\system.properties
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: Version 5.6.3
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: java.version=19.0.1
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: os.name=Windows 10
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: os.arch=amd64
2024-11-27 20:10:47,813 INFO o.a.j.JMeter: os.version=10.0
2024-11-27 20:10:47,814 INFO o.a.j.JMeter: file.encoding=UTF-8
2024-11-27 20:10:47,814 INFO o.a.j.JMeter: java.awt.headless=true
2024-11-27 20:10:47,814 INFO o.a.j.JMeter: Max memory     =1073741824
2024-11-27 20:10:47,814 INFO o.a.j.JMeter: Available Processors =16
2024-11-27 20:10:47,826 INFO o.a.j.JMeter: Default Locale=English (EN)
2024-11-27 20:10:47,827 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2024-11-27 20:10:47,827 INFO o.a.j.JMeter: JMeterHome=C:\Utils\apache-jmeter-5.6.3
2024-11-27 20:10:47,827 INFO o.a.j.JMeter: user.dir  =C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter
2024-11-27 20:10:47,828 INFO o.a.j.JMeter: PWD       =C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter
2024-11-27 20:10:52,354 INFO o.a.j.JMeter: IP: 169.254.5.254 Name: OlijebwaPC FullName: OlijebwaPC
2024-11-27 20:10:52,388 INFO o.a.j.s.FileServer: Default base='C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter'
2024-11-27 20:10:52,391 INFO o.a.j.s.FileServer: Set new base='C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter'
2024-11-27 20:10:52,597 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2024-11-27 20:10:52,630 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2024-11-27 20:10:52,634 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2024-11-27 20:10:52,637 INFO o.a.j.s.SaveService: Loading file: C:\Users\danie\Dropbox\bonjr\coding\VSProjects\Lets_SAS_RPI_Websites\Jmeter\traffic_simulation.jmx
2024-11-27 20:10:52,706 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 20:10:52,706 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 20:10:52,706 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 20:10:52,706 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-11-27 20:10:52,706 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2024-11-27 20:10:52,706 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2024-11-27 20:10:52,734 INFO o.a.j.JMeter: Creating summariser <summary>
2024-11-27 20:10:52,748 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2024-11-27 20:10:52,748 INFO o.a.j.s.SampleEvent: List of sample_variables: [FLIGHTTOCOUNT, FLIGHTRETCOUNT, ONEWAY]
2024-11-27 20:10:52,749 INFO o.a.j.s.SampleEvent: List of sample_variables: [FLIGHTTOCOUNT, FLIGHTRETCOUNT, ONEWAY]
2024-11-27 20:10:52,754 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2024-11-27 20:10:52,754 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2024-11-27 20:10:52,822 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-2.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 20:10:52,835 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\json-simple-1.1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 20:10:52,838 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\acmeair-jmeter-2.0.0-SNAPSHOT.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 20:10:52,845 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.6.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 20:10:52,951 INFO o.a.j.r.ClassFinder: Will scan jar C:\Utils\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-11-27 20:10:52,961 INFO o.a.j.JMeter: Running test (1732756252961)
2024-11-27 20:10:52,977 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : jp@gc - Stepping Thread Group
2024-11-27 20:10:52,977 INFO o.a.j.e.StandardJMeterEngine: Starting 100 threads for group jp@gc - Stepping Thread Group.
2024-11-27 20:10:52,977 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2024-11-27 20:10:52,977 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 100
2024-11-27 20:10:53,010 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2024-11-27 20:10:53,010 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2024-11-27 20:11:02,978 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-1
2024-11-27 20:11:03,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-2
2024-11-27 20:11:03,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-3
2024-11-27 20:11:03,578 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-4
2024-11-27 20:11:03,780 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-5
2024-11-27 20:11:04,074 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = OlijebwaPC
2024-11-27 20:11:04,080 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2024-11-27 20:11:04,082 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2024-11-27 20:11:04,082 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2024-11-27 20:11:04,082 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2024-11-27 20:11:04,082 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2024-11-27 20:11:08,978 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-6
2024-11-27 20:11:09,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-7
2024-11-27 20:11:09,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-8
2024-11-27 20:11:09,578 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-9
2024-11-27 20:11:09,778 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-10
2024-11-27 20:11:14,977 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-11
2024-11-27 20:11:15,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-12
2024-11-27 20:11:15,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-13
2024-11-27 20:11:15,577 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-14
2024-11-27 20:11:15,778 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-15
2024-11-27 20:11:20,977 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-16
2024-11-27 20:11:21,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-17
2024-11-27 20:11:21,377 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-18
2024-11-27 20:11:21,577 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-19
2024-11-27 20:11:21,777 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-20
2024-11-27 20:11:26,977 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-21
2024-11-27 20:11:27,177 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-22
2024-11-27 20:11:27,377 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-23
2024-11-27 20:11:27,581 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-24
2024-11-27 20:11:27,777 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-25
2024-11-27 20:11:32,979 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-26
2024-11-27 20:11:33,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-27
2024-11-27 20:11:33,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-28
2024-11-27 20:11:33,577 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-29
2024-11-27 20:11:33,778 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-30
2024-11-27 20:11:38,977 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-31
2024-11-27 20:11:39,180 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-32
2024-11-27 20:11:39,377 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-33
2024-11-27 20:11:39,578 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-34
2024-11-27 20:11:39,778 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-35
2024-11-27 20:11:44,977 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-36
2024-11-27 20:11:45,177 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-37
2024-11-27 20:11:45,377 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-38
2024-11-27 20:11:45,577 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-39
2024-11-27 20:11:45,777 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-40
2024-11-27 20:11:50,978 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-41
2024-11-27 20:11:51,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-42
2024-11-27 20:11:51,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-43
2024-11-27 20:11:51,577 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-44
2024-11-27 20:11:51,778 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-45
2024-11-27 20:11:56,977 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-46
2024-11-27 20:11:57,178 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-47
2024-11-27 20:11:57,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-48
2024-11-27 20:11:57,578 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-49
2024-11-27 20:11:57,704 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2024-11-27 20:11:57,704 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2024-11-27 20:11:57,778 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-50
2024-11-27 20:12:00,087 INFO o.a.j.r.Summariser: summary +     15 in 00:01:07 =    0.2/s Avg:    33 Min:    30 Max:    41 Err:    15 (100.00%) Active: 50 Started: 50 Finished: 0